InformationRegisters/ХранилищеИсторииЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеИсторииЧатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаСохранения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиСохраненияИсторииЧатов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяАкаунта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Отправители</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мессенджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиЧатов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыЧатовТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыЧатовТелеграм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Отправители</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяАкаунта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХранилищеИсторииЧатов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НовыйФильтр() Экспорт

	Фильтр = Новый Структура;
	Фильтр.Вставить("НачалоПериода", Неопределено);
	Фильтр.Вставить("КонецПериода", Неопределено);
	Фильтр.Вставить("Количество", Неопределено);
	
	Возврат Фильтр;

КонецФункции // ()

Функция История(Клиент, Фильтр = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ &КоличествоЗаписей
		|	ХранилищеИсторииЧатов.Период КАК Дата,
		|	ХранилищеИсторииЧатов.Клиент КАК Клиент,
		|	ХранилищеИсторииЧатов.Мессенджер КАК Мессенджер,
		|	ХранилищеИсторииЧатов.НастройкаСохранения КАК НастройкаСохранения
		|ИЗ
		|	РегистрСведений.ХранилищеИсторииЧатов КАК ХранилищеИсторииЧатов
		|ГДЕ
		|	ХранилищеИсторииЧатов.ИмяАкаунта = &ИмяАкаунта
		|	&ПериодИстории
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	ВладелецЧата = УправлениеМетаданными.МенеджерОбъектаПоСсылке(Клиент)
		.ВладелецМесенджера(Клиент);
	Данные = РегистрыСведений.ИдентификаторыЧатовТелеграм
		.ДанныеАкаунта(ВладелецЧата);
	
	ИмяАкаунта = ?(ЗначениеЗаполнено(Данные), Данные["ИмяАкаунта"], Неопределено);
	Запрос.УстановитьПараметр("ИмяАкаунта", ИмяАкаунта);
	
	КоличествоЗаписей = ?(Фильтр["Количество"] = Неопределено, "", "ПЕРВЫЕ " + Фильтр["Количество"]);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоЗаписей", КоличествоЗаписей);
	
	НачалоПериода = ?(Фильтр["НачалоПериода"] = Неопределено, "", " И ХранилищеИсторииЧатов.Период >= &Начало");
	КонецПериода = ?(Фильтр["КонецПериода"] = Неопределено, "", " И ХранилищеИсторииЧатов.Период <= &Конец");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодИстории", НачалоПериода + КонецПериода);

	Запрос.УстановитьПараметр("Начало", Фильтр["НачалоПериода"]);
	Запрос.УстановитьПараметр("Конец", Фильтр["КонецПериода"]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
